# Brewfile — allends/dotfiles
# Run: brew bundle install
# Taps
tap "yakitrak/yakitrak"

# Shells
brew "zsh"
brew "fish"

# Shell enhancements
brew "starship"       # Cross-shell prompt
brew "zoxide"         # Smarter cd
brew "eza"            # Better ls
brew "bat"            # Better cat
brew "tre-command"    # Better tree (aliased as `tree`)
brew "fzf"            # Fuzzy finder
brew "fd"             # Better find
brew "ripgrep"        # Better grep

# Dev tooling
brew "gh"             # GitHub CLI
brew "git"
brew "mise"           # Runtime version manager (node, python, etc.)
brew "stow"           # Dotfile symlink manager
brew "lazygit"        # Terminal git UI

# Editors
brew "helix"          # Modal editor

# Notes
brew "notesmd-cli"    # Obsidian vault CLI
brew "zk"             # Zettelkasten LSP (used with helix)

# macOS only (ignored on Linux)
cask "zed"
cask "obsidian"
cask "1password"
cask "orbstack"
